0xffff#6.553500000000000e+04
0b1011#1.100000000000000e+01
0o377#2.550000000000000e+02
123_456.789_E8#1.234567890000000e+13
const a:123*4=a#4.920000000000000e+02
def f(x,y){x*y}=f(2,3)#6.000000000000000e+00
ICBETA(2,3,0.4)#5.248000000000000E-01
ISNORMAL(0)#1.000000000000000e+00
ISNORMAL(NAN)#0.000000000000000e+00
ISBREAK(0)#0.000000000000000e+00
ISBREAK(BREAK)#1.000000000000000e+00
ISCONT(0)#0.000000000000000e+00
ISCONT(CONT)#1.000000000000000e+00
ISNAN(0)#0.000000000000000e+00
ISNAN(NAN)#1.000000000000000e+00
ISUNDEF(0)#0.000000000000000e+00
ISUNDEF(UNDEF)#1.000000000000000e+00
ISCONT(OR(1,cont))#1.000000000000000e+00
ISBREAK(AND(0,break))#1.000000000000000e+00
a[0]:2=a[1]:1=SORT(a)=a[0]#1.000000000000000e+00
a[10]#0.000000000000000e+00
a[0]:1=a[1]:2=RSORT(a)=a[0]#2.000000000000000e+00
a[10]:10=SIZE(a)#1.100000000000000e+01
UNLESS(1,2,3)#3.000000000000000e+00
UNLESS(0,2,3)#2.000000000000000e+00
break::break#0.000000000000000e+00
0.2::0.20#1.000000000000000e+00
0.2::0.21#0.000000000000000e+00
0.21::0.2#0.000000000000000e+00
0.2>:0.20#1.000000000000000e+00
0.2>:0.21#0.000000000000000e+00
0.21>:0.2#1.000000000000000e+00
0.2>0.20#0.000000000000000e+00
0.21>0.2#1.000000000000000e+00
0.2>0.21#0.000000000000000e+00
0.2<:0.20#1.000000000000000e+00
0.2<:0.21#1.000000000000000e+00
0.21<:0.2#0.000000000000000e+00
0.2<0.20#0.000000000000000e+00
0.2<0.21#1.000000000000000e+00
0.21<0.2#0.000000000000000e+00
0.0&&0.2#0.000000000000000e+00
0.1&&0.2#2.000000000000000e-01
0.2&&0.0#0.000000000000000e+00
nan&&0.1#nan
0.0&&nan#0.000000000000000e+00
0.1&&nan#nan
undef&&0.1#undefined
0.0&&undef#0.000000000000000e+00
0.1&&undef#undefined
0.1&&break#0.000000000000000e+00
0.1&&cont#0.000000000000000e+00
break&&0.1#0.000000000000000e+00
cont&&0.1#0.000000000000000e+00
0.0||0.2#2.000000000000000e-01
0.21||0.2#2.100000000000000e-01
0.21||0.0#2.100000000000000e-01
nan||0.1#1.000000000000000e-01
0.0||nan#nan
0.1||nan#1.000000000000000e-01
undef||0.1#1.000000000000000e-01
0.0||undef#undefined
0.1||undef#1.000000000000000e-01
0.1||break#1.000000000000000e-01
0.1||cont#1.000000000000000e-01
break||0.1#1.000000000000000e-01
cont||0.1#1.000000000000000e-01
(zeta_int(2)*6)^0.5#3.141592653589793e+00
(zeta(2)*6)^0.5#3.141592653589794e+00
((zetam1_int(2)+1)*6)^0.5#3.141592653589793e+00
((zetam1(2)+1)*6)^0.5#3.141592653589794e+00
jnu(1.5,2.3)#5.2110918572117E-01
ynu(1.5,2.3)#-2.3991644631326E-01
jl(5,2.3)#5.0374877417878E-03
yl(5,2.3)#-8.6948247901974E+00
in(5,2.3)#2.0824734274240E-02
kn(5,2.3)#4.3528686306516E+00
inu(1.5,2.3)#1.5208328933032E+00
knu(1.5,2.3)#1.1887891043736E-01
prog1(1,2,3)#1.0000000000000E+00
prog2(1,2,3)#2.0000000000000E+00
progn(1,2,3)#3.0000000000000E+00
progn(1,2,UNDEF)#undefined
mjd2year(51603)#2.000000000000000e+03
mjd2month(51603)#2.000000000000000e+00
mjd2day(51603)#2.900000000000000e+01
mjd2wday(51603)#2.000000000000000e+00
mjd2yday(51603)#6.000000000000000e+01
unix2mjd(0)#4.058700000000000e+04
cm(BREAK)=isbreak(rm(0))#1.0000000000000E+00
cm(100)=rm(0)#1.0000000000000E+02
push(a,3)#3.000000000000000e-00
push(a,4)#4.000000000000000e-00
unshift(a,2)#2.000000000000000e-00
unshift(a,1)#1.000000000000000e-00
pop(a)#4.000000000000000e-00
shift(a)#1.000000000000000e-00
pop(a)#3.000000000000000e-00
shift(a)#2.000000000000000e-00
min(1,2,3,4,5,6,7,8,9,10)#1
max(1,2,3,4,5,6,7,8,9,10)#10
